In [1]:
import numpy as np

In [4]:
pat = np.array([5, 4, 4, 3, 9, 4])

In [6]:
Jack = np.array([4, 8, 7, 5, 1, 5])
Alex = np.array([9, 9, 8, 10, 4, 10])

In [11]:
df = np.hstack((pat,Jack,Alex))

In [13]:
import pandas as pd

In [14]:
df = pd.DataFrame()

In [15]:
df["pat"] = pat

In [17]:
df["Jack"] = Jack
df["Alex"] = Alex

In [18]:
df

   pat  Jack  Alex
0    5     4     9
1    4     8     9
2    4     7     8
3    3     5    10
4    9     1     4
5    4     5    10

In [19]:
import pandas as pd
pat = [5, 4, 4, 3, 9, 4]
Jack = [4, 8, 7, 5, 1, 5]
Alex = [9, 9, 8, 10, 4, 10]

In [20]:
scores = pat + Jack + Alex
scores

[5, 4, 4, 3, 9, 4, 4, 8, 7, 5, 1, 5, 9, 9, 8, 10, 4, 10]

In [23]:
player = (['pat']*len(pat)) + (["Jack"] * len(Jack)) + (["Alex"]*len(Alex))
player

['pat',
 'pat',
 'pat',
 'pat',
 'pat',
 'pat',
 'Jack',
 'Jack',
 'Jack',
 'Jack',
 'Jack',
 'Jack',
 'Alex',
 'Alex',
 'Alex',
 'Alex',
 'Alex',
 'Alex']

In [25]:
data = pd.DataFrame({"Player": player,"Scores":scores})
data.head(7)

  Player  Scores
0    pat       5
1    pat       4
2    pat       4
3    pat       3
4    pat       9
5    pat       4
6   Jack       4

In [27]:
data.groupby("Player").mean()

          Scores
Player
Alex    8.333333
Jack    5.000000
pat     4.833333

In [28]:
data.groupby(["Player"]).mean()

          Scores
Player
Alex    8.333333
Jack    5.000000
pat     4.833333

In [29]:
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [30]:
lm = ols("Scores ~ Player",data=data).fit()
table = sm.stats.anova_lm(lm)
print(table)

            df     sum_sq    mean_sq         F    PR(>F)
Player     2.0  46.777778  23.388889  4.488273  0.029668
Residual  15.0  78.166667   5.211111       NaN       NaN

PR is lesser than 0.05 and hence we reject the Null Hypothesis which means there is a significant difference.